tutorials/incompressible/icoDyMFoam/turboPassageRotating/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (9.6592582628906829 2.5881904510252074 0);

boundaryField
{
    inlet
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -10;
        value           uniform (9.6592582628906829 2.5881904510252074 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    movingwalls
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    rotor_cyclic_upper
    {
       type             cyclicGgi;
    }
    rotor_cyclic_lower
    {
       type             cyclicGgi;
    }
    stator_cyclics
    {
       type             cyclic;
    }
    interface1
    {
        type            overlapGgi;
    }
    interface2
    {
        type            overlapGgi;
    }
}

// ************************************************************************* //
